In [1]:
from sqlalchemy import create_engine
from collections import OrderedDict
import pandas as pd
import numpy as np

In [2]:
server = 'LAPTOP-5PD425U8'
database = 'Project_UK'
driver = 'SQL Server Native Client 11.0'
connection = f'mssql://@{server}/{database}?driver={driver}'

engine = create_engine(connection,pool_size=10, max_overflow=20)
conn = engine.connect()

In [3]:
query ="""SELECT * FROM [Project_UK].[dbo].[VoterID_UK]"""

In [4]:
df = pd.read_sql_query(query, conn)

In [5]:
df.head()

             VoterID        VoterName RelationName
0  UP/85/421/0042622         Mahajabi     Dilashad
1  UP/85/421/0042363      Jalaluddeen    Nasir Ali
2  UP/85/421/0042362       Aurangajeb    Nasir Ali
3         BQW1036607  Shahina Praveen   Aurangajeb
4         BQW1036581          Shajiya      Dilshad

In [6]:
v = []

for i in df["VoterName"]:
    i = i.split()
    a = list(dict.fromkeys(i))
    a= list(map(lambda x: x.replace('\u200d',''),a))
    a = ' '.join(a)
    a = " ".join(a.split())
    a = a.title()
    v.append(a)
    
df['VoterName'] = v

In [7]:
r = []

for i in df["RelationName"]:
    i = i.split()
    a = list(dict.fromkeys(i))
    a = list(map(lambda x: x.replace('\u200d',''),a))
    a = ' '.join(a)
    a = " ".join(a.split())
    a = a.title()
    r.append(a)
    
df['RelationName'] = r

In [8]:
df.head()

             VoterID        VoterName RelationName
0  UP/85/421/0042622         Mahajabi     Dilashad
1  UP/85/421/0042363      Jalaluddeen    Nasir Ali
2  UP/85/421/0042362       Aurangajeb    Nasir Ali
3         BQW1036607  Shahina Praveen   Aurangajeb
4         BQW1036581          Shajiya      Dilshad

In [9]:
df.to_sql('VoterID_UK', engine, if_exists='replace', index=False)